{
  "profiel": "Met meer dan 10 jaar ervaring als fullstack softwareontwikkelaar, gespecialiseerd in .NET, TypeScript, Angular, React en Azure, ontwerp en implementeer ik schaalbare IT-oplossingen voor complexe omgevingen. Door automatisering en het gebruik van moderne .NET standaarden zorg ik voor optimalisatie en verbetering van processen. Een van mijn grootste project was het transformeren van een bestaand legacy systeem naar een moderne infrastructuur, wat leidde tot betere prestaties en kostenbesparingen. Mijn doel is om mijn expertise in te zetten en hiermee bij te dragen aan op maat gemaakte oplossingen voor de klant.",
  "vaardigheden": "Ik beschik over een combinatie van technische expertise en sterke probleemoplossende vaardig-heden. Door mijn analytisch vermogen kan ik complexe situaties snel doorgronden en omzetten in praktische oplossingen. Ik ben flexibel en leergierig, waardoor ik snel nieuwe technologieën en methoden eigen maak en vind moeiteloos mijn weg in nieuwe werkomgevingen. Daarnaast heb ik sterke communicatieve en samenwerkingsvaardigheden, wat mij in staat stelt om goed te werken binnen teams of zelfstandig. Ik streef er altijd naar om resultaten te behalen die voldoen aan zo-wel de projectdoelen als de verwachtingen van de klant.",
  "opleidingen": [
    {
      "naam": "Avans Hogeschool Breda",
      "studie": "Technische Informatica",
      "periode": "2010 - 2015"
    },
    {
      "naam": "Telematica",
      "studie": "MBO Niveau 4 (MTS)",
      "periode": "2006 - 2010"
    }
  ],
  "cursussen": [
    {
      "naam": "Azure AZ 900",
      "cursus": "Microsoft Azure Fundamentals",
      "periode": "2020"
    },
    {
      "naam": "Azure AZ 104",
      "cursus": "Microsoft Azure Administrator",
      "periode": "2021"
    },
    {
      "naam": "Azure AZ 204",
      "cursus": "Developing Solutions for Microsoft Azure",
      "periode": "2021"
    },
    {
      "naam": "Azure AZ 400",
      "cursus": "Designing and Implementing Microsoft DevOps Solutions",
      "periode": "2021"
    },
    {
      "naam": "Scrum Master PSM 1",
      "cursus": "Scrum Master PSM 1",
      "periode": "2021"
    },
    {
      "naam": "Angular",
      "cursus": "Angular",
      "periode": "2016"
    },
    {
      "naam": "Embedded Linux Vijfhart",
      "cursus": "Embedded Linux",
      "periode": "2016"
    },
    {
      "naam": "Design Patterns CompuTrain",
      "cursus": "Design Patterns",
      "periode": "2015"
    },
    {
      "naam": "Programmeren in C++ CompuTrain",
      "cursus": "Programmeren in C++",
      "periode": "2015"
    }
  ],
  "werkervaringen": [
    {
      "bedrijf": "Rabobank Utrecht",
      "rol": "Full stack Developer / DevOps Engineer",
      "periode": "2021 - heden",
      "situatie": "Als full stack developer binnen Tech 4 Dev (T4D) bij Rabobank ondersteun ik wereldwijd meer dan 400 ontwikkelteams bij het naleven van de bank's compliancy-richtlijnen binnen hun pipelines. Dit realiseer ik door container based applicaties te ontwikkelen die de pipelines op geautomatiseerde wijze controleren en waar nodig corrigeren. Om de teams inzicht te geven in de status van hun pipelines, ontwikkel ik een dashboard met Angular. Daarnaast ben ik verantwoordelijk voor het verstrekken van data aan verschillende teams binnen de bank, voor de meeste actuele informatie. Daarnaast ontwikkel en onderhoud ik een dashboard waarmee de status van de pipelines wordt gemonitord en gerapporteerd.",
      "taken": [
        "Ontwikkelen van continainerized microservices in C# en .NET Core",
        "Ontwikkelen van een Angular dashboard",
        "Implementeren van compliancy rules van de bank",
        "Infrastructure as a code in Azure",
        "Monitoring en rapportage in PowerBI",
        "Stakeholder management",
        "Code Reviews"
      ],
      "gereedschappen": [
        "C#",
        ".NET Core",
        "Git",
        "NodeJS",
        "Webpack",
        "Jest",
        "HTML5/CSS/SASS",
        "JavsScript/TypeScript",
        "Visual Studio Code",
        "Azure DevOps CI/CD",
        "Angular",
        "ngrx/store",
        "tailwindcss",
        "powershell",
        "bicep",
        "terraform",
        "storybook",
        "docker",
        "kubernetes",
        "OAuth2/JWT",
        "REST"
      ]
    }
  ]
}
